sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_ledc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/spinlock.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include <sys/param.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/kmalloc.h>

#include "esp_gpio.h"
#include "esp_ledc.h"
#include "riscv_internal.h"

#include <arch/chip/gpio_sig_map.h>
#include "esp_private/periph_ctrl.h"
#include "hal/ledc_hal.h"
#include "hal/ledc_types.h"
#include "soc/soc_caps.h"
#include "hal/ledc_periph.h"
#include "clk_ctrl_os.h"
#include "esp_clk_tree.h"
#include "esp_private/esp_clk_tree_common.h"
#include "esp_attr.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define LEDC_TIMER_DIV_NUM_MAX    (0x3FFFF)

#define LEDC_IS_DIV_INVALID(div)  ((div) <= LEDC_LL_FRACTIONAL_MAX || \
                                   (div) > LEDC_TIMER_DIV_NUM_MAX)

/* Precision degree only affects RC_FAST, other clock sources' frequencies
 * are fixed values. For targets that do not support RC_FAST calibration,
 * can only use its approximate value.
 */

#if SOC_CLK_RC_FAST_SUPPORT_CALIBRATION
#  define LEDC_CLK_SRC_FREQ_PRECISION ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED
#else
#  define LEDC_CLK_SRC_FREQ_PRECISION ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX
#endif

#if !SOC_RCC_IS_INDEPENDENT
#define LEDC_BUS_CLOCK_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#define LEDC_BUS_CLOCK_ATOMIC()
#endif

#if SOC_PERIPH_CLK_CTRL_SHARED
#define LEDC_FUNC_CLOCK_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#define LEDC_FUNC_CLOCK_ATOMIC()
#endif

/* All chips have 4 internal timers */

#define LEDC_TIMERS               (4)

/* If PWM multi-channel is disabled, then only one channel is supported per
 * timer. Thus, the number of channels is the same as the number of timers.
 * Note that we only support the maximum of 6 PWM channels.
 */

#if defined(CONFIG_PWM_NCHANNELS) && CONFIG_PWM_NCHANNELS > 1
#  define LEDC_CHANNELS           SOC_LEDC_CHANNEL_NUM
#else
#  define LEDC_CHANNELS           LEDC_TIMERS
#endif

/* LEDC timer0 channels and offset */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER0
#  if defined(CONFIG_PWM_NCHANNELS) && CONFIG_PWM_NCHANNELS > 1
#    define LEDC_TIM0_CHANS       CONFIG_ESPRESSIF_LEDC_TIMER0_CHANNELS
#  else
#    define LEDC_TIM0_CHANS       (1)
#  endif
#  define LEDC_TIM0_CHANS_OFF     (0)
#endif

/* LEDC timer1 channels and offset */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER1
#  if defined(CONFIG_PWM_NCHANNELS) && CONFIG_PWM_NCHANNELS > 1
#    define LEDC_TIM1_CHANS       CONFIG_ESPRESSIF_LEDC_TIMER1_CHANNELS
#  else
#    define LEDC_TIM1_CHANS       (1)
#  endif
#  define LEDC_TIM1_CHANS_OFF     (LEDC_TIM0_CHANS_OFF + LEDC_TIM0_CHANS)
#endif

/* LEDC timer2 channels and offset */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER2
#  if defined(CONFIG_PWM_NCHANNELS) && CONFIG_PWM_NCHANNELS > 1
#    define LEDC_TIM2_CHANS       CONFIG_ESPRESSIF_LEDC_TIMER2_CHANNELS
#  else
#    define LEDC_TIM2_CHANS       (1)
#  endif
#  define LEDC_TIM2_CHANS_OFF     (LEDC_TIM1_CHANS_OFF + LEDC_TIM1_CHANS)
#endif

/* LEDC timer3 channels and offset */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER3
#  if defined(CONFIG_PWM_NCHANNELS) && CONFIG_PWM_NCHANNELS > 1
#    define LEDC_TIM3_CHANS       CONFIG_ESPRESSIF_LEDC_TIMER3_CHANNELS
#  else
#    define LEDC_TIM3_CHANS       (1)
#  endif
#  define LEDC_TIM3_CHANS_OFF     (LEDC_TIM2_CHANS_OFF + LEDC_TIM2_CHANS)
#endif

/* Uninitialized LEDC timer clock */

#define LEDC_SLOW_CLK_UNINIT      (-1)

/* Clock not found */

#define LEDC_CLK_NOT_FOUND        (0)

/* LEDC keep config */

#define LEDC_VAL_NO_CHANGE        (-1)

/* LEDC Timer default frequency */

#define LEDC_DEFAULT_FREQ         (1000)

/* Check max LEDC channels number */

#if CONFIG_ESPRESSIF_LEDC_TIMER0_CHANNELS + \
    CONFIG_ESPRESSIF_LEDC_TIMER1_CHANNELS + \
    CONFIG_ESPRESSIF_LEDC_TIMER2_CHANNELS + \
    CONFIG_ESPRESSIF_LEDC_TIMER3_CHANNELS > LEDC_CHANNELS
#  error "Too many LEDC channels. The maximum number of channels used " \
         "by all timers is 6 when multi-channel PWM is enabled and " \
         "4 when multi-channel PWM is disabled."
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* LEDC timer channel configuration */

struct esp_ledc_chan_s
{
  const uint8_t num;                    /* PWM channel ID */
  const uint8_t pin;                    /* PWM channel GPIO pin number */

  uint32_t duty;                        /* PWM channel current duty */
};

/* This structure represents the state of one LEDC timer */

struct esp_ledc_s
{
  const struct pwm_ops_s *ops;          /* PWM operations */

  const uint8_t timer;                  /* Timer ID */

