sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
  const uint8_t channels;               /* Timer channels number */
  struct esp_ledc_chan_s *chans;        /* Timer channels pointer */

  ledc_timer_bit_t duty_resolution;     /* Timer duty resolution */
  ledc_clk_cfg_t clk_cfg;               /* Timer clock configuration */
  uint32_t frequency;                   /* Timer current frequency */
  uint32_t reload;                      /* Timer current reload */
};

struct ledc_obj_s
{
  ledc_hal_context_t ledc_hal;               /* LEDC hal context */
  ledc_slow_clk_sel_t glb_clk;               /* LEDC global clock selection */
  bool timer_is_stopped[LEDC_TIMER_MAX];     /* Indicates whether each timer has been stopped */
  bool glb_clk_is_acquired[LEDC_TIMER_MAX];  /* Tracks whether the global clock is being acquired by each timer */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

#if 0 /* Should be added when sleep is supported */
extern void esp_sleep_periph_use_8m(bool use_or_not);
#endif

static bool ledc_ctx_create(void);
static bool ledc_slow_clk_calibrate(void);
static uint32_t ledc_calculate_divisor(uint32_t src_clk_freq,
                                       int freq_hz,
                                       uint32_t precision);

static uint32_t ledc_auto_global_clk_div(int freq_hz,
                                         uint32_t precision,
                                         ledc_slow_clk_sel_t *clk_target);

static uint32_t ledc_auto_clk_divisor(int freq_hz,
                                      uint32_t precision,
                                      ledc_clk_src_t *clk_source,
                                      ledc_slow_clk_sel_t *clk_target);

static int ledc_timer_set(ledc_timer_t timer_sel,
                          uint32_t clock_divider,
                          uint32_t duty_resolution,
                          ledc_clk_src_t clk_src);

static int ledc_set_timer_div(ledc_timer_t timer_num,
                              ledc_clk_cfg_t clk_cfg,
                              int freq_hz,
                              int duty_resolution);

static int ledc_timer_resume(ledc_timer_t timer_sel);
static int ledc_timer_rst(ledc_timer_t timer_sel);
static int ledc_timer_pause(ledc_timer_t timer_sel);
static int setup_timer(struct esp_ledc_s *priv);
static int ledc_duty_config(ledc_channel_t channel,
                            int hpoint_val,
                            int duty_val,
                            ledc_duty_direction_t duty_direction,
                            uint32_t duty_num,
                            uint32_t duty_cycle,
                            uint32_t duty_scale);

static int ledc_set_duty_with_hpoint(ledc_channel_t channel,
                                     uint32_t duty,
                                     uint32_t hpoint);

static int ledc_channel_output_enable(ledc_channel_t channel);
static int ledc_channel_output_disable(ledc_channel_t channel);
static int ledc_update_duty(ledc_channel_t channel);
static uint32_t ledc_duty_bin_conversion(uint16_t nuttx_duty,
                                         uint32_t duty_resolution);

static int ledc_bind_channel_timer(ledc_channel_t channel,
                                   ledc_timer_t timer_sel);

static void setup_channel(struct esp_ledc_s *priv, int cn);
static int pwm_setup(struct pwm_lowerhalf_s *dev);
static int pwm_shutdown(struct pwm_lowerhalf_s *dev);
static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info);

static int pwm_stop(struct pwm_lowerhalf_s *dev);
static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                     unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* LEDC context */

static struct ledc_obj_s *p_ledc_obj = NULL;

/* LEDC available timer global clocks */

static const ledc_slow_clk_sel_t s_glb_clks[] = LEDC_LL_GLOBAL_CLOCKS;

/* Current RC_FAST frequency */

static uint32_t s_ledc_slow_clk_rc_fast_freq = 0;

/* LEDC PWM operations */

static const struct pwm_ops_s g_pwmops =
{
  .setup       = pwm_setup,
  .shutdown    = pwm_shutdown,
  .start       = pwm_start,
  .stop        = pwm_stop,
  .ioctl       = pwm_ioctl
};

/* LEDC channels table */

static struct esp_ledc_chan_s g_ledc_chans[LEDC_CHANNELS] =
{
  {
    .num       = 0,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL0_PIN
  },
  {
    .num       = 1,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL1_PIN
  },
  {
    .num       = 2,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL2_PIN
  },
  {
    .num       = 3,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL3_PIN
  },
#if LEDC_CHANNELS > 4
  {
    .num       = 4,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL4_PIN
  },
  {
    .num       = 5,
    .pin       = CONFIG_ESPRESSIF_LEDC_CHANNEL5_PIN
  }
#endif
};

/* LEDC timer0 private data */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER0

#  if CONFIG_ESPRESSIF_LEDC_TIMER0_RESOLUTION > SOC_LEDC_TIMER_BIT_WIDTH
#    error "Invalid PWM Timer 0 resolution."
#  endif

static struct esp_ledc_s g_pwm0dev =
{
  .ops             = &g_pwmops,
  .timer           = 0,
  .channels        = LEDC_TIM0_CHANS,
  .chans           = &g_ledc_chans[LEDC_TIM0_CHANS_OFF],
  .duty_resolution = CONFIG_ESPRESSIF_LEDC_TIMER0_RESOLUTION,
  .clk_cfg         = LEDC_AUTO_CLK,
  .frequency       = LEDC_DEFAULT_FREQ
};
#endif /* CONFIG_ESPRESSIF_LEDC_TIMER0 */

/* LEDC timer1 private data */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER1

#  if CONFIG_ESPRESSIF_LEDC_TIMER1_RESOLUTION > SOC_LEDC_TIMER_BIT_WIDTH
#    error "Invalid PWM Timer 1 resolution."
#  endif

static struct esp_ledc_s g_pwm1dev =
{
  .ops             = &g_pwmops,
  .timer           = 1,
  .channels        = LEDC_TIM1_CHANS,
  .chans           = &g_ledc_chans[LEDC_TIM1_CHANS_OFF],
  .duty_resolution = CONFIG_ESPRESSIF_LEDC_TIMER1_RESOLUTION,
  .clk_cfg         = LEDC_AUTO_CLK,
  .frequency       = LEDC_DEFAULT_FREQ
};
