sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
#endif /* CONFIG_ESPRESSIF_LEDC_TIMER1 */

/* LEDC timer2 private data */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER2

#  if CONFIG_ESPRESSIF_LEDC_TIMER2_RESOLUTION > SOC_LEDC_TIMER_BIT_WIDTH
#    error "Invalid PWM Timer 2 resolution."
#  endif

static struct esp_ledc_s g_pwm2dev =
{
  .ops             = &g_pwmops,
  .timer           = 2,
  .channels        = LEDC_TIM2_CHANS,
  .chans           = &g_ledc_chans[LEDC_TIM2_CHANS_OFF],
  .duty_resolution = CONFIG_ESPRESSIF_LEDC_TIMER2_RESOLUTION,
  .clk_cfg         = LEDC_AUTO_CLK,
  .frequency       = LEDC_DEFAULT_FREQ
};
#endif /* CONFIG_ESPRESSIF_LEDC_TIMER2 */

/* LEDC timer3 private data */

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER3

#  if CONFIG_ESPRESSIF_LEDC_TIMER3_RESOLUTION > SOC_LEDC_TIMER_BIT_WIDTH
#    error "Invalid PWM Timer 3 resolution."
#  endif

static struct esp_ledc_s g_pwm3dev =
{
  .ops             = &g_pwmops,
  .timer           = 3,
  .channels        = LEDC_TIM3_CHANS,
  .chans           = &g_ledc_chans[LEDC_TIM3_CHANS_OFF],
  .duty_resolution = CONFIG_ESPRESSIF_LEDC_TIMER3_RESOLUTION,
  .clk_cfg         = LEDC_AUTO_CLK,
  .frequency       = LEDC_DEFAULT_FREQ
};
#endif /* CONFIG_ESPRESSIF_LEDC_TIMER3 */

/****************************************************************************
 * Private functions
 ****************************************************************************/

/****************************************************************************
 * Name: ledc_ctx_create
 *
 * Description:
 *   Create LEDC context.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   True if context was created, false otherwise.
 *
 ****************************************************************************/

static bool ledc_ctx_create(void)
{
  bool new_ctx = false;
  irqstate_t flags;

  flags = enter_critical_section();

  if (!p_ledc_obj)
    {
      struct ledc_obj_s *ledc_new_mode_obj;
      ledc_new_mode_obj = (struct ledc_obj_s *)
        kmm_calloc(1, sizeof(struct ledc_obj_s));
      if (ledc_new_mode_obj)
        {
          new_ctx = true;

          LEDC_BUS_CLOCK_ATOMIC()
            {
              ledc_ll_enable_bus_clock(true);
              ledc_ll_enable_reset_reg(false);
            }

          LEDC_FUNC_CLOCK_ATOMIC()
            {
              ledc_ll_enable_clock(LEDC_LL_GET_HW(), true);
            }

          /* Only ESP32 supports High Speed mode */

          ledc_hal_init(&(ledc_new_mode_obj->ledc_hal), LEDC_LOW_SPEED_MODE);
          ledc_new_mode_obj->glb_clk = LEDC_SLOW_CLK_UNINIT;
          p_ledc_obj = ledc_new_mode_obj;
      }
  }

  leave_critical_section(flags);

  return new_ctx;
}

/****************************************************************************
 * Name: ledc_slow_clk_calibrate
 *
 * Description:
 *   Calibrate RC_FAST clock.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   True if calibration was successful, false otherwise.
 *
 ****************************************************************************/

static bool ledc_slow_clk_calibrate(void)
{
  if (periph_rtc_dig_clk8m_enable())
    {
      s_ledc_slow_clk_rc_fast_freq = periph_rtc_dig_clk8m_get_freq();
#if !SOC_CLK_RC_FAST_SUPPORT_CALIBRATION
      pwminfo("Calibration cannot be performed."
              "Approximate RC_FAST_CLK : %"PRIu32" Hz\n",
              s_ledc_slow_clk_rc_fast_freq);
#else
      pwminfo("Calibrate RC_FAST_CLK : %"PRIu32" Hz",
              s_ledc_slow_clk_rc_fast_freq);
#endif
      return true;
    }

  pwmerr("Calibrate RC_FAST_CLK failed\n");
  return false;
}

/****************************************************************************
 * Name: ledc_calculate_divisor
 *
 * Description:
 *   Calculate the divisor to achieve the desired frequency.
 *
 * Input Parameters:
 *   src_clk_freq - The source clock frequency.
 *   freq_hz      - The desired frequency.
 *   precision    - The granularity of the clock.
 *
 * Returned Value:
 *   The divisor parameter to use to achieve the frequency requested.
 *
 ****************************************************************************/

static inline uint32_t ledc_calculate_divisor(uint32_t src_clk_freq,
                                              int freq_hz,
                                              uint32_t precision)
{
  /* In order to find the right divisor, we need to divide the source clock
   * frequency by the desired frequency. However, two things to note here:
   * - The lowest LEDC_LL_FRACTIONAL_BITS bits of the result are the
   *   FRACTIONAL part. The higher bits represent the integer part, this is
   *   why we need to right shift the source frequency.
   * - The `precision` parameter represents the granularity of the clock. It
   *   **must** be a power of 2. It means that the resulted divisor is
   *   a multiplier of `precision`.
   *
   * Let's take a concrete example, we need to generate a 5KHz clock out of
   * a 80MHz clock (APB).
   * If the precision is 1024 (10 bits), the resulted multiplier is:
   * (80000000 << 8) / (5000 * 1024) = 4000 (0xfa0)
   * Let's ignore the fractional part to simplify the explanation, so we get
   * a result of 15 (0xf).
   * This can be interpreted as: every 15 "precision" ticks, the resulted
   * clock will go high, where one precision tick is made out of 1024 source
   * clock ticks.
   * Thus, every `15 * 1024` source clock ticks, the resulted clock will go
   * high.
   *
   * NOTE: We are also going to round up the value when necessary, thanks to:
   * (freq_hz * precision) / 2
   */

  return (((uint64_t)src_clk_freq << LEDC_LL_FRACTIONAL_BITS) + \
          ((freq_hz * precision) / 2)) / (freq_hz * precision);
}

/****************************************************************************
 * Name: ledc_auto_global_clk_div
 *
 * Description:
 *   Try to find the clock with its divisor giving the frequency requested
 *   by the caller.
 *
 * Input Parameters:
 *   freq_hz    - Frequency to achieve;
 *   precision  - Precision of the frequency to achieve;
 *   clk_target - Clock target to use.
 *
 * Returned Value:
 *   The divisor parameter to use to achieve the frequency requested.
 *
 ****************************************************************************/

static uint32_t ledc_auto_global_clk_div(int freq_hz,
                                         uint32_t precision,
                                         ledc_slow_clk_sel_t *clk_target)
{
  uint32_t ret = LEDC_CLK_NOT_FOUND;
  uint32_t clk_freq = 0;

  /* This function will go through all the following clock sources to look
   * for a valid divisor which generates the requested frequency.
   */

  for (int i = 0; i < nitems(s_glb_clks); i++)
    {
      /* Before calculating the divisor, we need to have the RC_FAST
       * frequency. If it hasn't been measured yet, try calibrating
       * it now.
       */

      if (s_glb_clks[i] == LEDC_SLOW_CLK_RC_FAST &&
          s_ledc_slow_clk_rc_fast_freq == 0 &&
          !ledc_slow_clk_calibrate())
        {
          pwminfo("Unable to retrieve RC_FAST clock frequency, skipping it");
          continue;
        }

