sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
      esp_clk_tree_src_get_freq_hz((soc_module_clk_t)s_glb_clks[i],
                                   LEDC_CLK_SRC_FREQ_PRECISION,
                                   &clk_freq);

      uint32_t div_param = ledc_calculate_divisor(clk_freq,
                                                  freq_hz,
                                                  precision);

      /* If the divisor is valid, we can return this value. */

      if (!LEDC_IS_DIV_INVALID(div_param))
        {
          *clk_target = s_glb_clks[i];
          ret = div_param;
          break;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: ledc_auto_clk_divisor
 *
 * Description:
 *   Try to find the clock with its divisor giving the frequency requested
 *   by the caller.
 *
 * Input Parameters:
 *   freq_hz    - Frequency to achieve;
 *   precision  - Precision of the frequency to achieve;
 *   clk_source - Clock source to use;
 *   clk_target - Clock target to use.
 *
 * Returned Value:
 *   The divisor parameter to use to achieve the frequency requested.
 *
 ****************************************************************************/

static uint32_t ledc_auto_clk_divisor(int freq_hz,
                                      uint32_t precision,
                                      ledc_clk_src_t *clk_source,
                                      ledc_slow_clk_sel_t *clk_target)
{
  uint32_t ret = LEDC_CLK_NOT_FOUND;

  uint32_t div_param_global = ledc_auto_global_clk_div(freq_hz,
                                                       precision,
                                                       clk_target);

  if (div_param_global != LEDC_CLK_NOT_FOUND)
    {
      pwminfo("Found a global clock source for frequency %d Hz "
              "and precision 0x%"PRIx32"\n", freq_hz, precision);
      *clk_source = LEDC_SCLK;
      ret = div_param_global;
    }
  else
    {
      pwminfo("Could not find a global clock source for frequency %d Hz "
              "and precision 0x%"PRIx32"\n", freq_hz, precision);
    }

  return ret;
}

/****************************************************************************
 * Name: ledc_timer_set
 *
 * Description:
 *   Set LEDC timer.
 *
 * Input Parameters:
 *   timer_sel      - Select the timer to be set;
 *   clock_divider  - The divider of the clock source;
 *   duty_resolution- The duty resolution of the timer;
 *   clk_src        - The clock source of the timer;
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int ledc_timer_set(ledc_timer_t timer_sel,
                          uint32_t clock_divider,
                          uint32_t duty_resolution,
                          ledc_clk_src_t clk_src)
{
  DEBUGASSERT(timer_sel < LEDC_TIMER_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  ledc_hal_set_clock_divider(&(p_ledc_obj->ledc_hal),
                             timer_sel,
                             clock_divider);

  ledc_hal_set_duty_resolution(&(p_ledc_obj->ledc_hal),
                               timer_sel,
                               duty_resolution);

  ledc_hal_ls_timer_update(&(p_ledc_obj->ledc_hal), timer_sel);

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Name: ledc_set_timer_div
 *
 * Description:
 *   Set LEDC timer divider.
 *
 * Input Parameters:
 *   timer_num - LEDC timer number;
 *   clk_cfg - LEDC timer clock source;
 *   freq_hz - LEDC timer frequency;
 *   duty_resolution - LEDC timer duty resolution.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int ledc_set_timer_div(ledc_timer_t timer_num,
                              ledc_clk_cfg_t clk_cfg,
                              int freq_hz,
                              int duty_resolution)
{
  irqstate_t flags;
  uint32_t div_param = 0;
  int i;
  const uint32_t precision = (0x1 << duty_resolution);

  /* The clock sources are not initialized on purpose. To produce compiler
   * warning if used but the selector functions don't set them properly.
   */

  /* Timer-specific mux. Set to timer-specific clock or LEDC_SCLK if a global
   * clock is used.
   */

  ledc_clk_src_t timer_clk_src;

  /* Global clock mux. Should be set when LEDC_SCLK is used in
   * LOW_SPEED_MODE. Otherwise left uninitialized.
   */

  ledc_slow_clk_sel_t glb_clk = LEDC_SLOW_CLK_UNINIT;

  if (clk_cfg == LEDC_AUTO_CLK)
    {
      /* User hasn't specified the speed, we should try to guess it. */

      pwminfo("Using auto clock source selection\n");

      div_param = ledc_auto_clk_divisor(freq_hz,
                                        precision,
                                        &timer_clk_src,
                                        &glb_clk);
    }
  else if (clk_cfg == LEDC_USE_RC_FAST_CLK)
    {
      pwminfo("Using RC_FAST clock source\n");

      /* Before calculating the divisor, we need to have the RC_FAST
       * frequency. If it hasn't been measured yet, try calibrating
       * it now.
       */

      if (s_ledc_slow_clk_rc_fast_freq == 0 &&
          ledc_slow_clk_calibrate() == false)
        {
          goto error;
        }

      /* Set the global clock source */

      timer_clk_src = LEDC_SCLK;
      glb_clk =  LEDC_SLOW_CLK_RC_FAST;

      /* We have the RC_FAST clock frequency now. */

      div_param = ledc_calculate_divisor(s_ledc_slow_clk_rc_fast_freq,
                                         freq_hz,
                                         precision);

      if (LEDC_IS_DIV_INVALID(div_param))
        {
          div_param = LEDC_CLK_NOT_FOUND;
        }
    }
  else
    {
      timer_clk_src = LEDC_SCLK;
      glb_clk = (ledc_slow_clk_sel_t)clk_cfg;

