sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
      uint32_t src_clk_freq = 0;
      esp_clk_tree_src_get_freq_hz((soc_module_clk_t)clk_cfg,
                                    LEDC_CLK_SRC_FREQ_PRECISION,
                                    &src_clk_freq);

      div_param = ledc_calculate_divisor(src_clk_freq, freq_hz, precision);

      if (LEDC_IS_DIV_INVALID(div_param))
        {
          div_param = LEDC_CLK_NOT_FOUND;
        }
    }

  if (div_param == LEDC_CLK_NOT_FOUND)
    {
      goto error;
    }

  pwminfo("Using clock source %d (in slow mode). Divisor: 0x%"PRIx32,
          timer_clk_src,
          div_param);

  /* The following block configures the global clock.
   * Arriving here, variable glb_clk must have been assigned to one of the
   * ledc_slow_clk_sel_t enum values
   */

  ASSERT(timer_clk_src == LEDC_SCLK);
  ASSERT(glb_clk != LEDC_SLOW_CLK_UNINIT);

  flags = enter_critical_section();

  if (p_ledc_obj->glb_clk != LEDC_SLOW_CLK_UNINIT &&
      p_ledc_obj->glb_clk != glb_clk)
    {
      for (i = 0; i < LEDC_TIMER_MAX; i++)
        {
          if (i != timer_num && p_ledc_obj->glb_clk_is_acquired[i])
            {
              leave_critical_section(flags);
              pwmerr("Timer clock conflict. Already is %d but attempt to %d",
                     p_ledc_obj->glb_clk,
                     glb_clk);
            }
        }
    }

  if (timer_num == LEDC_TIMER_MAX - 1 &&
      p_ledc_obj->glb_clk_is_acquired[timer_num - 1])
    {
      return -EINVAL;
    }

  p_ledc_obj->glb_clk_is_acquired[timer_num] = true;
  if (p_ledc_obj->glb_clk != glb_clk)
    {
      p_ledc_obj->glb_clk = glb_clk;
      esp_clk_tree_enable_src((soc_module_clk_t)p_ledc_obj->glb_clk, true);
      LEDC_FUNC_CLOCK_ATOMIC()
        {
          ledc_hal_set_slow_clk_sel(&(p_ledc_obj->ledc_hal), glb_clk);
        }
    }

  leave_critical_section(flags);

  pwminfo("In slow speed mode. Global clock: %d", glb_clk);

  /* Keep ESP_PD_DOMAIN_RC_FAST on during light sleep */

#if 0 /* Should be added when sleep is supported */
#ifndef CONFIG_ARCH_CHIP_ESP32H2 /* TODO: Remove when H2 light sleep is supported */
  esp_sleep_periph_use_8m(glb_clk == LEDC_SLOW_CLK_RC_FAST);
#endif
#endif

  /* The divisor is correct, we can write in the hardware. */

  ledc_timer_set(timer_num, div_param, duty_resolution, timer_clk_src);
  return OK;

error:
  pwmerr("Requested frequency and duty resolution can not be achieved. "
         "Try reducing the frequency or timer resolution.\n");

  return -EINVAL;
}

/****************************************************************************
 * Name: ledc_timer_resume
 *
 * Description:
 *   Resume a LEDC timer.
 *
 * Input Parameters:
 *   timer_sel - LEDC timer id.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int ledc_timer_resume(ledc_timer_t timer_sel)
{
  DEBUGASSERT(timer_sel < LEDC_TIMER_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  p_ledc_obj->timer_is_stopped[timer_sel] = false;
  ledc_hal_timer_resume(&(p_ledc_obj->ledc_hal), timer_sel);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ledc_timer_rst
 *
 * Description:
 *   Reset a LEDC timer.
 *
 * Input Parameters:
 *   timer_sel - LEDC timer id.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int ledc_timer_rst(ledc_timer_t timer_sel)
{
  DEBUGASSERT(timer_sel < LEDC_TIMER_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  ledc_hal_timer_rst(&(p_ledc_obj->ledc_hal), timer_sel);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ledc_timer_pause
 *
 * Description:
 *   Pause a LEDC timer.
 *
 * Input Parameters:
 *   timer_sel - LEDC timer id.
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int ledc_timer_pause(ledc_timer_t timer_sel)
{
  DEBUGASSERT(timer_sel < LEDC_TIMER_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  p_ledc_obj->timer_is_stopped[timer_sel] = true;
  ledc_hal_timer_pause(&(p_ledc_obj->ledc_hal), timer_sel);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: setup_timer
 *
 * Description:
 *   Setup LEDC timer frequency and reload.
 *
 * Input Parameters:
 *   priv - A reference to the LEDC timer state structure
 *
 * Returned Value:
 *   Zero (OK) is returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int setup_timer(struct esp_ledc_s *priv)
{
  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(priv->timer < LEDC_TIMER_MAX);
  DEBUGASSERT(priv->frequency > 0);
  DEBUGASSERT(priv->duty_resolution < LEDC_TIMER_BIT_MAX &&
              priv->duty_resolution > 0);

  int ret;

  if (!ledc_ctx_create() && !p_ledc_obj)
    {
      pwmerr("ERROR: No memory for LEDC context\n");
      PANIC();
    }

  ret = ledc_set_timer_div(priv->timer,
                           priv->clk_cfg,
                           priv->frequency,
                           priv->duty_resolution);

  if (ret == OK)
    {
      ledc_timer_pause(priv->timer);
      ledc_timer_rst(priv->timer);
    }

  return ret;
}

/****************************************************************************
 * Name: ledc_duty_config
 *
 * Description:
 *   Set the duty cycle of a PWM channel.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *   hpoint_val - LEDC channel hpoint value.
 *   duty_val - LEDC channel duty value.
 *   duty_direction - LEDC channel duty direction.
 *   duty_num - LEDC channel duty number.
 *   duty_cycle - LEDC channel duty cycle.
 *
 * Returned Value:
 *   OK.
 *
 ****************************************************************************/

static IRAM_ATTR int ledc_duty_config(ledc_channel_t channel,
                                      int hpoint_val,
                                      int duty_val,
                                      ledc_duty_direction_t duty_direction,
                                      uint32_t duty_num,
                                      uint32_t duty_cycle,
                                      uint32_t duty_scale)
{
  if (hpoint_val >= 0)
    {
      ledc_hal_set_hpoint(&(p_ledc_obj->ledc_hal), channel, hpoint_val);
    }

  if (duty_val >= 0)
    {
      ledc_hal_set_duty_int_part(&(p_ledc_obj->ledc_hal), channel, duty_val);
    }

  pwminfo("ledc_duty_config: channel: %d, hpoint_val: %d, duty_val: %d, "
          "duty_direction: %d, duty_num: %" PRIu32 ", "
          "duty_cycle: %" PRIu32 ", duty_scale: %" PRIu32 "\n",
          channel, hpoint_val, duty_val, duty_direction, duty_num,
          duty_cycle, duty_scale);
  ledc_hal_set_fade_param(&(p_ledc_obj->ledc_hal), channel, 0,
                         duty_direction, duty_cycle, duty_scale, duty_num);

#if SOC_LEDC_GAMMA_CURVE_FADE_SUPPORTED
  ledc_hal_set_range_number(&(p_ledc_obj->ledc_hal), channel, 1);
  ledc_hal_clear_left_off_fade_param(&(p_ledc_obj->ledc_hal), channel, 1);
#endif
  return OK;
}

/****************************************************************************
 * Name: ledc_set_duty_with_hpoint
 *
 * Description:
 *   Set the duty cycle of a PWM channel with a given hpoint value.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *   duty - Duty cycle value.
 *   hpoint - Hpoint value.
 *
 * Returned Value:
 *   Ok on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

