sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
static int ledc_set_duty_with_hpoint(ledc_channel_t channel,
                                     uint32_t duty,
                                     uint32_t hpoint)
{
  DEBUGASSERT(channel < LEDC_CHANNEL_MAX);
  DEBUGASSERT(hpoint <= LEDC_LL_HPOINT_VAL_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  ledc_duty_config(channel, hpoint, duty, LEDC_DUTY_DIR_INCREASE, 1, 1, 0);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ledc_channel_output_enable
 *
 * Description:
 *   Enable LEDC channel output.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *
 * Returned Value:
 *   Ok on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

static int ledc_channel_output_enable(ledc_channel_t channel)
{
  DEBUGASSERT(channel < LEDC_CHANNEL_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  ledc_hal_set_sig_out_en(&(p_ledc_obj->ledc_hal), channel, true);
  ledc_hal_set_duty_start(&(p_ledc_obj->ledc_hal), channel);

  return OK;
}

/****************************************************************************
 * Name: ledc_channel_output_disable
 *
 * Description:
 *   Disable LEDC channel output.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *
 * Returned Value:
 *   Ok on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

static int ledc_channel_output_disable(ledc_channel_t channel)
{
  DEBUGASSERT(channel < LEDC_CHANNEL_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  ledc_hal_set_idle_level(&(p_ledc_obj->ledc_hal), channel, 0);
  ledc_hal_set_sig_out_en(&(p_ledc_obj->ledc_hal), channel, false);
  ledc_hal_set_duty_start(&(p_ledc_obj->ledc_hal), channel);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ledc_update_duty
 *
 * Description:
 *   Update the duty cycle of a PWM channel.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *
 * Returned Value:
 *   Ok on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

static int ledc_update_duty(ledc_channel_t channel)
{
  DEBUGASSERT(channel < LEDC_CHANNEL_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  ledc_channel_output_enable(channel);

  flags = enter_critical_section();
  ledc_hal_ls_channel_update(&(p_ledc_obj->ledc_hal), channel);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: ledc_duty_bin_conversion
 *
 * Description:
 *   Truncate or expand the duty cycle value to fit the duty resolution.
 *
 * Input Parameters:
 *   nuttx_duty - Duty cycle value from nuttx.
 *   duty_resolution - Duty resolution of the channel.
 *
 * Returned Value:
 *   Truncated or expanded duty cycle value.
 *
 ****************************************************************************/

static uint32_t ledc_duty_bin_conversion(uint16_t nuttx_duty,
                                         uint32_t duty_resolution)
{
  /* Calculate the maximum value based on the duty resolution */

  uint32_t max_value = (1 << duty_resolution) - 1;

  /* Map the value to the specified range */

  uint32_t mapped_value = (nuttx_duty * max_value) / UINT16_MAX;

  return mapped_value;
}

/****************************************************************************
 * Name: ledc_bind_channel_timer
 *
 * Description:
 *   Bind a LEDC channel to a LEDC timer.
 *
 * Input Parameters:
 *   channel - LEDC channel index.
 *   timer_sel - LEDC timer index.
 *
 * Returned Value:
 *   Ok on success; A negated errno value is returned on failure.
 *
 ****************************************************************************/

static int ledc_bind_channel_timer(ledc_channel_t channel,
                                   ledc_timer_t timer_sel)
{
  DEBUGASSERT(timer_sel < LEDC_TIMER_MAX);

  if (p_ledc_obj == NULL)
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  irqstate_t flags;

  flags = enter_critical_section();

  ledc_hal_bind_channel_timer(&(p_ledc_obj->ledc_hal), channel, timer_sel);
  ledc_hal_ls_channel_update(&(p_ledc_obj->ledc_hal), channel);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: setup_channel
 *
 * Description:
 *   Setup LEDC timer channel duty.
 *
 * Input Parameters:
 *   priv - A reference to the LEDC timer state structure
 *   cn   - Timer channel number
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void setup_channel(struct esp_ledc_s *priv, int cn)
{
  irqstate_t flags;
  bool new_ctx_created;
  struct esp_ledc_chan_s *chan = &priv->chans[cn];

  new_ctx_created = ledc_ctx_create();
  if (!new_ctx_created && !p_ledc_obj)
    {
      pwmerr("ERROR: No memory for LEDC context\n");
      PANIC();
    }
#if !(defined(CONFIG_ARCH_CHIP_ESP32H2) || defined(CONFIG_ARCH_CHIP_ESP32P4))
  /* On such targets, the default ledc core(global) clock does not connect to
   * any clock source. Setting channel configurations and updating bits
   * before core clock is enabled could lead to an error.
   * Therefore, we should connect the core clock to a real clock source to
   * enable it before any ledc register operation happens.
   * It can be switched to the other desired clock sources to meet the output
   * PWM frequency requirements later at timer configuration.
   * So we consider the glb_clk still as LEDC_SLOW_CLK_UNINIT.
   */

