sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
  else if (new_ctx_created)
    {
      flags = enter_critical_section();

      if (p_ledc_obj->glb_clk == LEDC_SLOW_CLK_UNINIT)
        {
          LEDC_FUNC_CLOCK_ATOMIC()
            {
              ledc_hal_set_slow_clk_sel(&(p_ledc_obj->ledc_hal),
                                        LEDC_LL_GLOBAL_CLK_DEFAULT);
            }
        }

      leave_critical_section(flags);
    }
#endif

  ledc_set_duty_with_hpoint(chan->num,
                            chan->duty,
                            CONFIG_ESPRESSIF_LEDC_HPOINT);

  ledc_bind_channel_timer(chan->num, priv->timer);

  flags = enter_critical_section();
  ledc_hal_set_fade_end_intr(&(p_ledc_obj->ledc_hal), chan->num, false);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: pwm_setup
 *
 * Description:
 *   This method is called when the driver is opened. The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_setup(struct pwm_lowerhalf_s *dev)
{
  struct esp_ledc_s *priv = (struct esp_ledc_s *)dev;
  int ret;

  pwminfo("Initializing PWM Timer %d with default frequency of %d Hz\n",
          priv->timer,
          LEDC_DEFAULT_FREQ);

  ret = setup_timer(priv);

  if (ret != OK)
    {
      pwmerr("ERROR: Failed to setup timer\n");
      return ret;
    }

  /* Setup channel GPIO pins */

  for (int i = 0; i < priv->channels; i++)
    {
      setup_channel(priv, i);

      pwminfo("Channel %d mapped to pin %d\n", priv->chans[i].num,
              priv->chans[i].pin);

      esp_configgpio(priv->chans[i].pin, OUTPUT | PULLUP);
      esp_gpio_matrix_out(priv->chans[i].pin,
                          ledc_periph_signal[0].sig_out0_idx +
                          priv->chans[i].num, 0, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: pwm_shutdown
 *
 * Description:
 *   This method is called when the driver is closed. The lower half driver
 *   stop pulsed output, free any resources, disable the timer hardware, and
 *   put the system into the lowest possible power usage state
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_shutdown(struct pwm_lowerhalf_s *dev)
{
  struct esp_ledc_s *priv = (struct esp_ledc_s *)dev;
#ifdef CONFIG_PWM_NCHANNELS
  int channels = MIN(priv->channels, CONFIG_PWM_NCHANNELS);
#else
  int channels = 1;
#endif

  pwminfo("Shutting down PWM Timer %d\n", priv->timer);

  /* Stop timer */

  pwm_stop(dev);

  /* Clear timer and channel configuration */

  priv->frequency = LEDC_DEFAULT_FREQ;

  for (int i = 0; i < channels; i++)
    {
      priv->chans[i].duty = 0;
    }

  if (p_ledc_obj != NULL)
    {
      kmm_free(p_ledc_obj);
      p_ledc_obj = NULL;
      s_ledc_slow_clk_rc_fast_freq = 0;

      LEDC_BUS_CLOCK_ATOMIC()
        {
          ledc_ll_enable_bus_clock(false);
          ledc_ll_enable_reset_reg(true);
        }

      LEDC_FUNC_CLOCK_ATOMIC()
        {
          ledc_ll_enable_clock(LEDC_LL_GET_HW(), false);
        }
    }
  else
    {
      pwmerr("ERROR: LEDC not initialized\n");
      return -ENODEV;
    }

  return 0;
}

/****************************************************************************
 * Name: pwm_start
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   dev  - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info)
{
  uint32_t duty;
  int ret = OK;
  irqstate_t flags;
  struct esp_ledc_s *priv = (struct esp_ledc_s *)dev;
#ifdef CONFIG_PWM_NCHANNELS
  int channels = MIN(priv->channels, CONFIG_PWM_NCHANNELS);
#else
  int channels = 1;
#endif

  /* Update timer with given PWM timer frequency */

  if (priv->frequency != info->frequency)
    {
      pwminfo("Setting Timer %" PRIu8
              " to frequency %" PRIu32
              " Hz using %" PRIu8 " bits of resolution\n",
              priv->timer,
              info->frequency,
              priv->duty_resolution);

      ret |= ledc_set_timer_div(priv->timer,
                                priv->clk_cfg,
                                info->frequency,
                                priv->duty_resolution);

      ret |= ledc_timer_rst(priv->timer);

      if (ret != OK)
        {
          pwmerr("ERROR: Failed to set timer configuration\n");
          return ret;
        }

      pwminfo("Timer %d successfully configured\n", priv->timer);
      priv->frequency = info->frequency;
    }

  /* Update timer with given PWM channel duty */

  for (int i = 0; i < channels; i++)
    {
#ifdef CONFIG_PWM_NCHANNELS
      duty = ledc_duty_bin_conversion(info->channels[i].duty,
                                      priv->duty_resolution);
#else
      duty = ledc_duty_bin_conversion(info[i].duty,
                                      priv->duty_resolution);
#endif
      if (priv->chans[i].duty != duty)
        {
          uint32_t max_value = (1 << priv->duty_resolution) - 1;
          pwminfo("Setting PWM channel %" PRIu8
                  " to duty cycle %" PRIu32 "(%0.4f)\n",
                  priv->chans[i].num,
                  duty,
                  (float)duty / max_value);

          flags = enter_critical_section();

          ret |= ledc_duty_config(priv->chans[i].num,
                                  LEDC_VAL_NO_CHANGE,
                                  duty,
                                  LEDC_DUTY_DIR_INCREASE,
                                  1,
                                  1,
                                  0);

          leave_critical_section(flags);
          ret |= ledc_update_duty(priv->chans[i].num);

          if (ret != OK)
            {
              pwmerr("ERROR: Failed to set channel configuration\n");
              return ret;
            }

          pwminfo("Channel %d successfully configured\n",
                  priv->chans[i].num);

