sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_ledc.c
          priv->chans[i].duty = duty;
        }

      ledc_channel_output_enable(priv->chans[i].num);
    }

  ledc_timer_resume(priv->timer);

  return 0;
}

/****************************************************************************
 * Name: pwm_stop
 *
 * Description:
 *   Stop the pulsed output and reset the timer resources.
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_stop(struct pwm_lowerhalf_s *dev)
{
  int i;
  int channel;
  struct esp_ledc_s *priv = (struct esp_ledc_s *)dev;

  pwminfo("Stopping PWM Timer %d\n", priv->timer);

  for (i = 0; i < priv->channels; i++)
    {
      ledc_channel_output_disable(priv->chans[i].num);
    }

  ledc_timer_pause(priv->timer);
  ledc_timer_rst(priv->timer);

  return 0;
}

/****************************************************************************
 * Name: pwm_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd,
                     unsigned long arg)
{
#ifdef CONFIG_DEBUG_PWM_INFO
  struct esp_ledc_s *priv = (struct esp_ledc_s *)dev;

  pwminfo("PWM Timer %d\n", priv->timer);
#endif

  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_ledc_init
 *
 * Description:
 *   Initialize one LEDC timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.
 *
 * Returned Value:
 *   On success, a pointer to the ESP32-C3 LEDC lower half PWM driver is
 *   returned. NULL is returned on any failure.
 *
 ****************************************************************************/

struct pwm_lowerhalf_s *esp_ledc_init(int timer)
{
  struct esp_ledc_s *lower = NULL;

  pwminfo("PWM Timer %u initialized\n", timer);

  switch (timer)
    {
#ifdef CONFIG_ESPRESSIF_LEDC_TIMER0
      case 0:
        {
          lower = &g_pwm0dev;
          break;
        }
#endif

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER1
      case 1:
        {
          lower = &g_pwm1dev;
          break;
        }
#endif

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER2
      case 2:
        {
          lower = &g_pwm2dev;
          break;
        }
#endif

#ifdef CONFIG_ESPRESSIF_LEDC_TIMER3
      case 3:
        {
          lower = &g_pwm3dev;
          break;
        }
#endif

      default:
        {
          pwmerr("ERROR: No such timer configured %d\n", timer);
          lower = NULL;
          break;
        }
    }

  return (struct pwm_lowerhalf_s *)lower;
}
